#!/bin/bash
set -e
# Функции
print_summary() {
    echo "--------------------------------------------------------"
    echo "Порт изменен на 1024"
    echo "--------------------------------------------------------"
    
    if [ "$KEY_ADDED" = true ]; then
        echo "Ваш публичный ключ добавлен"
        echo "--------------------------------------------------------"
        if [ "$PASSWORD_DISABLED" = true ]; then
            echo "Вход по паролю выключен"
        else
            echo "Вход по паролю включен"
        fi
    else
        echo "Вход по паролю включен"
    fi
    
    echo "--------------------------------------------------------"
    echo "Баннеры скрыты, новый создан."
    echo "--------------------------------------------------------"
    echo "Фаервол включен, порт 1024 открыт"
    echo "--------------------------------------------------------"
    echo "Текущие ключи в authorized_keys:"
    
    if [ -f "/root/.ssh/authorized_keys" ]; then
        cat /root/.ssh/authorized_keys | sed '/^$/d'
    else
        echo "(Файл пуст или еще не создан)"
    fi
    echo "--------------------------------------------------------"
}

exec < /dev/tty
# Убедимся, что мы root
if [[ $EUID -ne 0 ]]; then
   echo "Этот скрипт должен быть запущен от root"
   exit 1
fi

# 0. Автоматический перезапуск сервисов (убирает вопросы и сканирование)
export NEEDRESTART_MODE=a
mkdir -p /etc/needrestart/conf.d
echo '$nrconf{restart} = "a";' > /etc/needrestart/conf.d/autopilot.conf
echo '$nrconf{kernelinc} = "no";' >> /etc/needrestart/conf.d/autopilot.conf
# Полный сброс терминала
printf "\033c"

echo "Начинаем настройку..."

# 1. Меняем порт в конфигурации SSH
echo "Меняем порт на 1024..."
sed -i 's/^#*Port.*/Port 1024/' /etc/ssh/sshd_config

# 2. Добавляем ключ и спрашиваем про пароль
echo "--------------------------------------------------------"
echo "ВСТАВЬТЕ ПУБЛИЧНЫЙ КЛЮЧ (id_ed25519.pub) ИЛИ ENTER ДЛЯ ПРОПУСКА:"
echo "--------------------------------------------------------"
read -r USER_SSH_KEY

KEY_ADDED=false
PASSWORD_DISABLED=false

if [[ -n "$USER_SSH_KEY" ]]; then
    mkdir -p /root/.ssh
    chmod 700 /root/.ssh
    echo "$USER_SSH_KEY" >> /root/.ssh/authorized_keys
    chmod 600 /root/.ssh/authorized_keys
    KEY_ADDED=true
    printf "\033c"
    echo "Ключ добавлен!"

    echo "--------------------------------------------------------"
    echo "ОТКЛЮЧИТЬ ВХОД ПО ПАРОЛЮ? (y/n)"
    echo "--------------------------------------------------------"
    read -r DISABLE_PWD
    if [[ "$DISABLE_PWD" =~ ^[Yy]$ ]]; then
        sed -i 's/^#*PasswordAuthentication.*/PasswordAuthentication no/' /etc/ssh/sshd_config
        PASSWORD_DISABLED=true
	echo "--------------------------------------------------------"
    	echo "Ключ добавлен, вход по паролю выключен."
    	echo "--------------------------------------------------------"
    else
        sed -i 's/^#*PasswordAuthentication.*/PasswordAuthentication yes/' /etc/ssh/sshd_config
	echo "--------------------------------------------------------"
    	echo "Ключ добавлен, вход по паролю включен."
    	echo "--------------------------------------------------------"
    fi
else
    printf "\033c"
    echo "--------------------------------------------------------"
    echo "Ввод ключа пропущен, вход по паролю включен."
    echo "--------------------------------------------------------"
fi

# 3. Убираем лишние надписи
echo "Очистка баннеров..."
echo "--------------------------------------------------------"
chmod -x /etc/update-motd.d/*
sed -i 's/^PrintMotd.*/PrintMotd no/' /etc/ssh/sshd_config
sed -i 's/^PrintLastLog.*/PrintLastLog no/' /etc/ssh/sshd_config

# 4. Настройка фаервола (UFW)
echo "Настройка фаервола..."
echo "--------------------------------------------------------"

# Установка и подавление любого вывода (stdout и stderr)
if ! command -v ufw > /dev/null; then
    apt-get update -qq > /dev/null 2>&1
    apt-get install -y -qq ufw > /dev/null 2>&1
fi

# Настройка правил без лишнего шума
ufw --force reset > /dev/null 2>&1
ufw default deny incoming > /dev/null 2>&1
ufw default allow outgoing > /dev/null 2>&1
ufw allow 1024/tcp > /dev/null 2>&1
ufw --force enable > /dev/null 2>&1

# Перезапуск SSH
systemctl restart ssh

sleep 2
printf "\033c"

# 5. Создаем картинку
cat << 'EOF' | tee /etc/motd
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣾⣿⣿⣿⣿⣷⢸⣿⣿⡜⢯⣷⡌⡻⣿⣿⣿⣆⢈⠻⠿⢿⣿⣿⣿⣿⣿⣿⣷⣦⣤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡁⢳⣿⣿⣿⣿⣿⣿⡜⣿⣿⣧⢀⢻⣷⠰⠈⢿⣿⣿⣧⢣⠉⠑⠪⢙⠿⠿⠿⠿⠿⠿⠿⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣱⡇⡞⣿⣿⣿⣿⣿⣿⡇⣿⣿⡏⡄⣧⠹⡇⠧⠈⢻⣿⣿⡇⢧⢢⠀⠀⠑⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣇⢃⢿⣿⣿⣿⣿⣿⣷⣿⣿⠇⢃⣡⣤⡹⠐⣿⣀⢻⣿⣿⢸⡎⠳⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣾⣿⣿⠘⡸⣿⣿⣿⣿⣿⣿⣿⡿⣰⣿⣿⢟⡷⠈⠋⠃⠎⢿⣿⡏⣿⠀⠘⢆⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⡐⢹⣿⣿⡐⢡⢹⣿⣿⣿⣿⡏⣿⢣⣿⣿⡑⠁⠔⠀⠉⠉⠢⡘⣿⡇⣿⡇⠀⡀⠡⡀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇⠘⣿⣿⣇⠇⢣⢻⣿⣿⣿⡇⢇⣾⣿⣿⡆⢸⣤⡀⠚⢂⠀⢡⢿⡇⣿⡇⠀⢿⠀⠀⠄⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⠠⠹⣿⣿⡘⣆⢣⠻⣿⣿⢈⣾⣿⣿⣿⣶⣸⣏⢀⣬⣋⡼⣠⢸⢹⣿⡇⢠⣼⠙⡄⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹⡇⠁⠹⣿⣇⠹⡃⠃⠙⡇⠘⢿⣿⣿⣿⣿⣿⣏⣓⣉⣭⣴⣿⠘⢸⣿⠁⠘⠋⠀⠹⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢷⠀⠀⠈⢿⣇⠂⣷⠄⠐⠀⠘⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢠⢸⡏⠀⢀⣠⣴⣾⣿⣶⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢆⠀⠀⠀⠙⠆⠈⠢⠲⠥⣰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⡞⣸⠁⠀⢸⣿⣿⣿⣿⣿⣿⡆⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠄⠃⠀⠀⠘⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢿⣿⣿⣿⣿⡏⠹⣿⣿⡿⠫⠊⠀⠀⠀⣶⠀⢻⣿⣿⣿⣿⡿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⠛⠻⠿⠿⠿⢋⠀⠀⠀⠀⢀⣼⣿⡆⠈⣿⣿⣿⡟⣱⡷⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢁⣁⡀⠨⣛⠿⠶⠄⢀⣠⣾⣿⣿⣷⠀⢹⣿⡟⣴⠈⢃⣶⠔⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣾⣿⣿⡄⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⡄⠈⣿⣿⡿⠀⡀⣿⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢙⠻⣿⣿⢀⠙⠻⠿⣿⣿⣿⣿⣿⣿⡇⠁⣿⠟⡀⠈⣧⢰⣿⠆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠿⠴⠮⣥⠻⢧⣤⣄⣀⡉⢩⣭⣍⣃⣀⣩⠎⢀⣼⠉⣼⡯⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠑⠁⣛⠓⢒⣒⣢⡭⢁⡈⠿⠿⠟⠹⠛⠁⠀⠀⠀⠰⠃⠂⠀⠀⠀
EOF

# 6. Вывод
print_summary

# 7. Очистка
# Принудительное удаление файла vps.sh и autopilot.conf
rm -f "$0"
rm -f /etc/needrestart/conf.d/autopilot.conf
